In [2]:
import numpy as np
import pandas as pd

In [3]:
sozlukVerisi = {"istanbul": [30,29,np.nan],"ankara":[20,np.nan,22],"izmir": [35,34,36]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     35
1      29.0     NaN     34
2       NaN    22.0     36

In [5]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     35

In [6]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     35
1     34
2     36

In [7]:
yeniVeri = {"istanbul": [30,29,np.nan],"ankara":[20,np.nan,22],"izmir": [35,34,36],"antalya": [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [8]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     35     45.0
1      29.0     NaN     34      NaN
2       NaN    22.0     36      NaN

In [9]:
yeniDataFrame.dropna(axis=1, thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     35
1      29.0     NaN     34
2       NaN    22.0     36

In [10]:
yeniDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     35     45.0
1      29.0    20.0     34     20.0
2      20.0    22.0     36     20.0

# groupby

In [11]:
maasSozlugu = {"Departman": ["Yazılım","Satış","Pazarlama","Finans","İnsan Kaynakları","Hukuk"],"Calisan Ismi": ["Sema","Tolga","Melis","Venüs","Nil","Gökay"],"Maaş": [10000,20000,5000,7000,10000,20000]}

In [12]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [13]:
maasDataFrame

          Departman Calisan Ismi   Maaş
0           Yazılım         Sema  10000
1             Satış        Tolga  20000
2         Pazarlama        Melis   5000
3            Finans        Venüs   7000
4  İnsan Kaynakları          Nil  10000
5             Hukuk        Gökay  20000

In [14]:
maas1Sozlugu = {"Departman": ["Yazılım","Yazılım","Finans","Finans","Hukuk","Hukuk"],"Calisan Ismi": ["Sema","Tolga","Melis","Venüs","Nil","Gökay"],"Maaş": [10000,20000,5000,7000,10000,20000]}

In [15]:
maas1DataFrame = pd.DataFrame(maas1Sozlugu)

In [16]:
maas1DataFrame

  Departman Calisan Ismi   Maaş
0   Yazılım         Sema  10000
1   Yazılım        Tolga  20000
2    Finans        Melis   5000
3    Finans        Venüs   7000
4     Hukuk          Nil  10000
5     Hukuk        Gökay  20000

In [26]:
groupObjesi = maas1DataFrame.groupby("Departman")

In [27]:
groupObjesi.count()

           Calisan Ismi  Maaş
Departman
Finans                2     2
Hukuk                 2     2
Yazılım               2     2

In [19]:
groupObjesi.mean()

            Maaş
Departman
Finans      6000
Hukuk      15000
Yazılım    15000

In [20]:
groupObjesi.min()

          Calisan Ismi   Maaş
Departman
Finans           Melis   5000
Hukuk            Gökay  10000
Yazılım           Sema  10000

In [21]:
groupObjesi.max()

          Calisan Ismi   Maaş
Departman
Finans           Venüs   7000
Hukuk              Nil  20000
Yazılım          Tolga  20000

In [22]:
groupObjesi.describe()

           Maaş                                                            \
          count     mean          std      min      25%      50%      75%
Departman
Finans      2.0   6000.0  1414.213562   5000.0   5500.0   6000.0   6500.0
Hukuk       2.0  15000.0  7071.067812  10000.0  12500.0  15000.0  17500.0
Yazılım     2.0  15000.0  7071.067812  10000.0  12500.0  15000.0  17500.0


               max
Departman
Finans      7000.0
Hukuk      20000.0
Yazılım    20000.0